List<String> CheckCategoryDetail({required int categoryNum}) {
  switch (categoryNum) {
    case 1:
      return ['اجاره آپارتمان', 'اجاره خانه و ویلا'];

    case 2:
      return ['فروش آپارتمان', 'فروش خانه و ویلا', 'فروش زمین و کلنگی'];

    case 3:
      return [
        'فروش دفتر کار , دفتر اداری و مطب',
        'فروش مغازه و غرفه',
        'فروش دفاتر صنعتی و کشاورزی و تجاری',
      ];
    case 4:
      return [
        'اجاره دفتر کار , اتاف اداری و مطب',
        'اجاره مغازه و غرفه',
        'اجاره دفاتر صنعتی , کشاورزی و تجاری',
      ];
    case 5:
      return [
        'اجاره کوتاه مدت آپارتمان و سوییت',
        'اجاره کوتاه مدت ویلا و باغ',
        'اجاره کوتاه مدت دفتر کار و فضای آموزش',
      ];
    case 6:
      return ['مشارکت در ساخت املاک', 'پیش فروش ملک'];
  }
  return [];
}
